# Задания

### Задание 1.

Вставьте пропущенный фрагмент кода, так чтобы в результате выполнения программы была выведена длина строки `s`.

**_Solution:_**
```python
s = 'Python rocks!'
print(len(s))
```

### Задание 2.

Вставьте пропущенный фрагмент кода, так чтобы в результате выполнения программы был выведен четвертый символ строки `s`.

**_Solution:_**
```python
s = 'Python rocks!'
print(s[3])
```

### Задание 3.

Вставьте пропущенный фрагмент кода, так чтобы в результате выполнения программы были выведены символы строки `s` со 2 по 5 включительно.

**_Solution:_**
```python
s = 'Python rocks!'
print(s[1:5])
```

### Задание 4.

Вставьте пропущенный фрагмент кода, так чтобы в результате выполнения программы была выведена строка `s` без ведущих и замыкающих пробельных символов.

**_Solution:_**
```python
s = '    Python rocks!     '
print(s.strip())
```

### Задание 5.

Вставьте пропущенный фрагмент кода, так чтобы в результате выполнения программы была выведена строка `s` заглавными буквами (в верхнем регистре).

```python
s = 'Python rocks!'
print(s.upper())
```

### Задание 6.

Вставьте пропущенный фрагмент кода, так чтобы в результате выполнения программы была выведена строка `s` в которой символ «o» заменен на символ «@».

```python
s = 'Python rocks!'
print(s.replace('o', '@', 2))
```

### Задание 7. Каждый третий.

На вход программе подается строка текста. Напишите программу, которая удаляет из нее все символы, кратные 3, то есть символы с индексами `0, 3, 6, ...`.

##### Формат входных данных 
На вход программе подается строка текста.

##### Формат выходных данных
Программа должна вывести строку текста в соответствии с условием задачи.

**Sample Input:**

`Python`

**Sample Output:**

`yton`

```python
s = input()

for i in range(len(s)):
    if i % 3 != 0:
        print(s[i], end="")
```

### Задание 8. Замени меня полностью.

На вход программе подается строка текста. Напишите программу, которая заменяет все вхождения цифры 1 на слово «one».

##### Формат входных данных 
На вход программе подается строка текста.

##### Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

**Sample Input:**

`1231`

**Sample Output:**

`one23one`

```python
print(input().replace('1', "one"))
```

### Задание 9. Удали меня полностью.

На вход программе подается строка текста. Напишите программу, которая удаляет все вхождения символа «@».

##### Формат входных данных 
На вход программе подается строка текста.

##### Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

**Sample Input:**

`123@1@@34`

**Sample Output:**

`123134`

```python
print(input().replace('@', ''))
```

### Задание 10. Второе вхождение.

На вход программе подается строка текста. Напишите программу, которая выводит индекс второго вхождения буквы «f». Если буква «f» встречается только один раз, выведите число -1, а если не встречается ни разу, выведите число -2.

##### Формат входных данных 
На вход программе подается строка текста.

##### Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

**Sample Input:**

`affective`

**Sample Output:**

`2`

```python
s = input()

cnt = s.count('f')

if cnt == 0:
    print(-2)
elif cnt == 1:
    print(-1)
else:
    print(s.find('f', s.find('f') + 1))
```

### Задание 11. Переворот.

На вход программе подается строка текста в которой буква «h» встречается как минимум два раза. Напишите программу, которая переворачивает и выводит последовательность символов, заключенную между первым и последним вхождением буквы «h».

##### Формат входных данных 
На вход программе подается строка текста.

##### Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

**Sample Input:**

`abch12345h`

**Sample Output:**

`abch54321h`

```python
s = input()

print(s.replace(s[s.find('h'):s.rfind('h')], s[s.rfind('h'):s.find('h'): -1]))
```


