# Задания

### Задание 1. Ревью кода - 7 🌶.

На обработку поступает натуральное число. Нужно написать программу, которая выводит на экран сумму чётных цифр этого числа или 0, если чётных цифр в записи нет. Программист торопился и написал программу неправильно.

Найдите все ошибки в этой программе (их может быть одна или несколько). Известно, что каждая ошибка затрагивает только одну строку и может быть исправлена без изменения других строк.

**Примечание**. Обратите внимание, что требуется найти ошибки в имеющейся программе, а не написать свою, возможно, использующую другой алгоритм решения.

**_Представленный код:_**

```python
n = input()
s = 0
while n > 10:
    if n % 2 == 1:
        s = n % 10
    n //= 10

print(s)
```

**_Исправленный код:_**

```python
n = int(input())
s = 0
while n > 0:
    if n % 2 == 0:
        s += n % 10
    n //= 10
print(s)
```

### Задание 2. Ревью кода - 8 🌶.

На обработку поступает последовательность из 8 целых чисел. Известно, что вводимые числа по абсолютной величине не превышают 10&#8310;. Нужно написать программу, которая выводит на экран количество делящихся нацело на 4 чисел в исходной последовательности и максимальное делящееся нацело на 4 число. Если делящихся нацело на 4 чисел нет, требуется на экран вывести «NO». Программист торопился и написал программу неправильно.

Найдите все ошибки в этой программе (их может быть одна или несколько). Известно, что каждая ошибка затрагивает только одну строку и может быть исправлена без изменения других строк.

**Примечание**. Обратите внимание, что требуется найти ошибки в имеющейся программе, а не написать свою, возможно, использующую другой алгоритм решения.


**_Представленный код:_**

```python
n = 7
count = 0
maximum = 1000
for i in range(1, n + 1):
    x = int(input())
    if x // 4 == 0:
        count += 1
        if x < maximum:
            maximum = x
if count > 0:
    print(count)
    print(maximum)
else:
    print('NO')
```

**_Исправленный код:_**

```python
count = 0
maximum = -10000000
for _ in range(8):
    x = int(input())
    if x % 4 == 0:
        count += 1
        if x > maximum:
            maximum = x
if count > 0:
    print(count)
    print(maximum)
else:
    print('NO')
```

### Задание 3. Ревью кода - 9.

На обработку поступает последовательность из 4 целых чисел. Известно, что вводимые числа по абсолютной величине не превышают 10&#8310;. Нужно написать программу, которая выводит на экран количество нечётных чисел в исходной последовательности и максимальное нечётное число. Если нечётных чисел нет, требуется на экран вывести «NO». Программист торопился и написал программу неправильно.
 
Найдите все ошибки в этой программе (их может быть одна или несколько). Известно, что каждая ошибка затрагивает только одну строку и может быть исправлена без изменения других строк.

**Примечание**. Обратите внимание, что требуется найти ошибки в имеющейся программе, а не написать свою, возможно, использующую другой алгоритм решения.


**_Представленный код:_**

```python
n = 4
count = 0
maximum = 999
for i in range(1, n + 1):
    x = int(input())
    if x % 2 != 0:
        count += 1
        if x > maximum:
            maximum = i
            break
if count > 0:
    print(count)
    print(maximum)
else:
    print('NO')
```

**_Исправленный код:_**

```python
count = 0
maximum = 0
for _ in range(4):
    x = int(input())
    if x % 2 != 0:
        count += 1
        if x > maximum:
            maximum = x
if count > 0:
    print(count)
    print(maximum)
else:
    print('NO')
```

### Задание 4. Звездная рамка.

На вход программе подается натуральное число nn. Напишите программу, которая печатает звездную рамку размерами n×19.

**Формат входных данных**
На вход программе подаётся натуральное число n∈[3;19] — высота звездной рамки.

**Формат выходных данных**
Программа должна вывести звездную рамку размерами n×19.

**Подсказка**. Для печати зведной линии используйте умножение строки на число.

**Sample input:**

`5`

**Sample output:**

```
*******************
*                 *
*                 *
*                 *
*******************
```

**_Solution:_**

```python
n = int(input())

for i in range(n):
    if i == 0 or i == n - 1:
        print(19 * '*')
    else:
        print('*', " " * 15, '*')
```

### Задание 5. Третья цифра.

Дано натуральное число (n>99). Напишите программу, которая определяет его третью (с начала) цифру.

**Формат входных данных**

На вход программе подается одно натуральное число, состоящее как минимум из трех цифр.

**Формат выходных данных**

Программа должна вывести его третью (с начала) цифру.

**Sample input:**

`3459087654`

**Sample output:**

`5`

**_Solution:_**

```python
n = int(input())

while n // 1000 > 0:
    n //= 10

print(n % 10)
```

### Задание 6. Все вместе 2.

Дано натуральное число. Напишите программу, которая вычисляет:

* сколько раз в нем встречается последняя цифра;
* количество четных цифр;
* сумму его цифр, больших пяти;
* произведение цифр, больших семи (если цифр больших семи нет, то вывести 1, если такая цифра одна, то вывести ее);
* сколько раз в нем встречается цифры 0 и 5 (всего суммарно).

**Формат входных данных**

На вход программе подается одно натуральное число.

**Формат выходных данных**

Программа должна вывести значения указанных величин в указанном порядке.

**Sample input:**

`56639`

**Sample output:**

```
1
1
2
21
9
1
```

**_Solution:_**

```python
n = int(input())
cnt3 = 0
cntLD = 0
cntEven = 0
ld = n % 10
sumGr5 = 0
multGr7 = 1
cnt05 = 0

while n > 0:
    x = n % 10

    if x == 3:
        cnt3 += 1

    if x == ld:
        cntLD += 1

    if x % 2 == 0:
        cntEven += 1

    if x > 5:
        sumGr5 += x

    if x > 7:
        multGr7 *= x

    if x == 0 or x == 5:
        cnt05 += 1
        
    n //= 10

print(cnt3)
print(cntLD)
print(cntEven)
print(sumGr5)
print(multGr7)
print(cnt05)

```

### Задание 7. Числа Рамануджана 🌶.

Сриниваса Рамануджан – индийский математик, славившийся своей интуицией в области чисел. Когда английский математик Годфри Харди навестил его однажды в больнице, он обмолвился, что номером такси, на котором он приехал, было 1729, такое скучное и заурядное число. На что Рамануджан ответил: "Нет, нет! Это очень интересное число. Это наименьшее число, выражаемое как сумма двух кубов двумя разными способами". Другими словамм:

`1729 = 1³ + 12³ = 9³ + 10³`

Напишите программу, которая находит аналогичные интересные числа. В ответе запишите первые 5 чисел в порядке возрастания, включая число 1729.

**Примечание**. Используйте вложенный цикл.

**_Solution:_**
```python
for i in range(1, 40):
    for j in range(1, 40):
        for k in range(1, 40):
            for p in range(1, 40):
                if i != k and i != p and j != k and j != p and i ** 3 + j ** 3 == k ** 3 + p ** 3:
                    print(i ** 3 + j ** 3)
```

**_Output:_**
```
1729
1729
4104
4104
13832
13832
39312
39312
46683
46683
32832
32832
1729
1729
4104
4104
40033
40033
1729
1729
20683
20683
1729
1729
4104
4104
39312
39312
4104
4104
40033
40033
64232
64232
13832
13832
32832
32832
20683
20683
13832
13832
13832
13832
20683
20683
64232
64232
20683
20683
46683
46683
32832
32832
46683
46683
32832
32832
39312
39312
40033
40033
39312
39312
40033
40033
46683
46683
64232
64232
64232
64232
```
